Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/pac.h
#define PAC_STATUSC_SERCOM_Pos                _UINT32_(1)                                          /* (PAC_STATUSC Position) SERCOM6 APB Protect Enable */
#define PAC_STATUSC_SERCOM_Msk                (_UINT32_(0x1) << PAC_STATUSC_SERCOM_Pos)            /* (PAC_STATUSC Mask) SERCOM */
#define PAC_STATUSC_SERCOM(value)             (PAC_STATUSC_SERCOM_Msk & (_UINT32_(value) << PAC_STATUSC_SERCOM_Pos)) 

/* -------- PAC_STATUSD : (PAC Offset: 0x40) ( R/ 32) Peripheral write protection status - Bridge D -------- */
#define PAC_STATUSD_RESETVALUE                _UINT32_(0x00)                                       /*  (PAC_STATUSD) Peripheral write protection status - Bridge D  Reset Value */

#define PAC_STATUSD_SERCOM2_Pos               _UINT32_(0)                                          /* (PAC_STATUSD) SERCOM2 APB Protect Enable Position */
#define PAC_STATUSD_SERCOM2_Msk               (_UINT32_(0x1) << PAC_STATUSD_SERCOM2_Pos)           /* (PAC_STATUSD) SERCOM2 APB Protect Enable Mask */
#define PAC_STATUSD_SERCOM2(value)            (PAC_STATUSD_SERCOM2_Msk & (_UINT32_(value) << PAC_STATUSD_SERCOM2_Pos)) /* Assigment of value for SERCOM2 in the PAC_STATUSD register */
#define PAC_STATUSD_SERCOM3_Pos               _UINT32_(1)                                          /* (PAC_STATUSD) SERCOM3 APB Protect Enable Position */
#define PAC_STATUSD_SERCOM3_Msk               (_UINT32_(0x1) << PAC_STATUSD_SERCOM3_Pos)           /* (PAC_STATUSD) SERCOM3 APB Protect Enable Mask */
#define PAC_STATUSD_SERCOM3(value)            (PAC_STATUSD_SERCOM3_Msk & (_UINT32_(value) << PAC_STATUSD_SERCOM3_Pos)) /* Assigment of value for SERCOM3 in the PAC_STATUSD register */
#define PAC_STATUSD_SERCOM4_Pos               _UINT32_(2)                                          /* (PAC_STATUSD) SERCOM4 APB Protect Enable Position */
#define PAC_STATUSD_SERCOM4_Msk               (_UINT32_(0x1) << PAC_STATUSD_SERCOM4_Pos)           /* (PAC_STATUSD) SERCOM4 APB Protect Enable Mask */
#define PAC_STATUSD_SERCOM4(value)            (PAC_STATUSD_SERCOM4_Msk & (_UINT32_(value) << PAC_STATUSD_SERCOM4_Pos)) /* Assigment of value for SERCOM4 in the PAC_STATUSD register */
#define PAC_STATUSD_SERCOM5_Pos               _UINT32_(3)                                          /* (PAC_STATUSD) SERCOM5 APB Protect Enable Position */
#define PAC_STATUSD_SERCOM5_Msk               (_UINT32_(0x1) << PAC_STATUSD_SERCOM5_Pos)           /* (PAC_STATUSD) SERCOM5 APB Protect Enable Mask */
#define PAC_STATUSD_SERCOM5(value)            (PAC_STATUSD_SERCOM5_Msk & (_UINT32_(value) << PAC_STATUSD_SERCOM5_Pos)) /* Assigment of value for SERCOM5 in the PAC_STATUSD register */
#define PAC_STATUSD_TC8_Pos                   _UINT32_(4)                                          /* (PAC_STATUSD) TC8 APB Protect Enable Position */
#define PAC_STATUSD_TC8_Msk                   (_UINT32_(0x1) << PAC_STATUSD_TC8_Pos)               /* (PAC_STATUSD) TC8 APB Protect Enable Mask */
#define PAC_STATUSD_TC8(value)                (PAC_STATUSD_TC8_Msk & (_UINT32_(value) << PAC_STATUSD_TC8_Pos)) /* Assigment of value for TC8 in the PAC_STATUSD register */
#define PAC_STATUSD_TC9_Pos                   _UINT32_(5)                                          /* (PAC_STATUSD) TC9 APB Protect Enable Position */
#define PAC_STATUSD_TC9_Msk                   (_UINT32_(0x1) << PAC_STATUSD_TC9_Pos)               /* (PAC_STATUSD) TC9 APB Protect Enable Mask */
#define PAC_STATUSD_TC9(value)                (PAC_STATUSD_TC9_Msk & (_UINT32_(value) << PAC_STATUSD_TC9_Pos)) /* Assigment of value for TC9 in the PAC_STATUSD register */
#define PAC_STATUSD_CAN0_Pos                  _UINT32_(8)                                          /* (PAC_STATUSD) CAN0 APB Protect Enable Position */
#define PAC_STATUSD_CAN0_Msk                  (_UINT32_(0x1) << PAC_STATUSD_CAN0_Pos)              /* (PAC_STATUSD) CAN0 APB Protect Enable Mask */
#define PAC_STATUSD_CAN0(value)               (PAC_STATUSD_CAN0_Msk & (_UINT32_(value) << PAC_STATUSD_CAN0_Pos)) /* Assigment of value for CAN0 in the PAC_STATUSD register */
#define PAC_STATUSD_CAN1_Pos                  _UINT32_(9)                                          /* (PAC_STATUSD) CAN1 APB Protect Enable Position */
#define PAC_STATUSD_CAN1_Msk                  (_UINT32_(0x1) << PAC_STATUSD_CAN1_Pos)              /* (PAC_STATUSD) CAN1 APB Protect Enable Mask */
#define PAC_STATUSD_CAN1(value)               (PAC_STATUSD_CAN1_Msk & (_UINT32_(value) << PAC_STATUSD_CAN1_Pos)) /* Assigment of value for CAN1 in the PAC_STATUSD register */
#define PAC_STATUSD_Msk                       _UINT32_(0x0000033F)                                 /* (PAC_STATUSD) Register Mask  */

#define PAC_STATUSD_SERCOM_Pos                _UINT32_(0)                                          /* (PAC_STATUSD Position) SERCOM2 APB Protect Enable */
#define PAC_STATUSD_SERCOM_Msk                (_UINT32_(0xF) << PAC_STATUSD_SERCOM_Pos)            /* (PAC_STATUSD Mask) SERCOM */
#define PAC_STATUSD_SERCOM(value)             (PAC_STATUSD_SERCOM_Msk & (_UINT32_(value) << PAC_STATUSD_SERCOM_Pos)) 
#define PAC_STATUSD_TC_Pos                    _UINT32_(4)                                          /* (PAC_STATUSD Position) TC8 APB Protect Enable */
#define PAC_STATUSD_TC_Msk                    (_UINT32_(0x3) << PAC_STATUSD_TC_Pos)                /* (PAC_STATUSD Mask) TC */
#define PAC_STATUSD_TC(value)                 (PAC_STATUSD_TC_Msk & (_UINT32_(value) << PAC_STATUSD_TC_Pos)) 
#define PAC_STATUSD_CAN_Pos                   _UINT32_(8)                                          /* (PAC_STATUSD Position) CANx APB Protect Enable */
#define PAC_STATUSD_CAN_Msk                   (_UINT32_(0x3) << PAC_STATUSD_CAN_Pos)               /* (PAC_STATUSD Mask) CAN */
#define PAC_STATUSD_CAN(value)                (PAC_STATUSD_CAN_Msk & (_UINT32_(value) << PAC_STATUSD_CAN_Pos)) 

/** \brief PAC register offsets definitions */
#define PAC_WRCTRL_REG_OFST            _UINT32_(0x00)      /* (PAC_WRCTRL) Write control Offset */
#define PAC_EVCTRL_REG_OFST            _UINT32_(0x04)      /* (PAC_EVCTRL) Event control Offset */
#define PAC_INTENCLR_REG_OFST          _UINT32_(0x08)      /* (PAC_INTENCLR) Interrupt enable clear Offset */
#define PAC_INTENSET_REG_OFST          _UINT32_(0x09)      /* (PAC_INTENSET) Interrupt enable set Offset */
#define PAC_INTFLAGAHB_REG_OFST        _UINT32_(0x10)      /* (PAC_INTFLAGAHB) Bridge interrupt flag status Offset */
#define PAC_INTFLAGA_REG_OFST          _UINT32_(0x14)      /* (PAC_INTFLAGA) Peripheral interrupt flag status - Bridge A Offset */
#define PAC_INTFLAGB_REG_OFST          _UINT32_(0x18)      /* (PAC_INTFLAGB) Peripheral interrupt flag status - Bridge B Offset */
#define PAC_INTFLAGC_REG_OFST          _UINT32_(0x1C)      /* (PAC_INTFLAGC) Peripheral interrupt flag status - Bridge C Offset */
#define PAC_INTFLAGD_REG_OFST          _UINT32_(0x20)      /* (PAC_INTFLAGD) Peripheral interrupt flag status - Bridge D Offset */
#define PAC_STATUSA_REG_OFST           _UINT32_(0x34)      /* (PAC_STATUSA) Peripheral write protection status - Bridge A Offset */
#define PAC_STATUSB_REG_OFST           _UINT32_(0x38)      /* (PAC_STATUSB) Peripheral write protection status - Bridge B Offset */
#define PAC_STATUSC_REG_OFST           _UINT32_(0x3C)      /* (PAC_STATUSC) Peripheral write protection status - Bridge C Offset */
#define PAC_STATUSD_REG_OFST           _UINT32_(0x40)      /* (PAC_STATUSD) Peripheral write protection status - Bridge D Offset */

